sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/responses/lowers/SeaShellsWSDLLowers.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:tns="http://org.jesperancinha.shells/SeaShellsWSDLLowers/"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  name="SeaShellsWSDLLowers" targetNamespace="http://org.jesperancinha.shells/SeaShellsWSDLLowers/">
    <wsdl:types>
        <xsd:schema targetNamespace="http://org.jesperancinha.shells/SeaShellsWSDLLowers/">
            <xsd:element name="LowersRequest">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="LowerId" type="xsd:long"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
            <xsd:element name="Lower">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="Type" type="xsd:string"/>
                        <xsd:element name="Color" type="xsd:string"/>
                        <xsd:element name="Size" type="xsd:string"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="lowersRequest">
        <wsdl:part element="tns:LowersRequest" name="parameters"/>
    </wsdl:message>
    <wsdl:message name="lowersResponse">
        <wsdl:part element="tns:Lower" name="parameters"/>
    </wsdl:message>
    <wsdl:portType name="SeaShellsWSDLLowers">
        <wsdl:operation name="lowers">
            <wsdl:input message="tns:lowersRequest"/>
            <wsdl:output message="tns:lowersResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="SeaShellsWSDLLowersSOAP" type="tns:SeaShellsWSDLLowers">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="lowers">
            <soap:operation soapAction="http://org.jesperancinha.shells/SeaShellsWSDLLowers/lowers"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="SeaShellsWSDLLowers">
        <wsdl:port binding="tns:SeaShellsWSDLLowersSOAP" name="SeaShellsWSDLLowersSOAP">
            <soap:address location="http://localhost:8090/seashells/lowers"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
