sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/responses/lowers/lower1.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:Lower xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLLowers/">
            <Type>PANTS</Type>
            <Color>#EEDDAA</Color>
            <Size>M</Size>
        </ns2:Lower>
    </S:Body>
</S:Envelope>
