sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/responses/lowers/lower2.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:Lower xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLLowers/">
            <Type>SKIRTS</Type>
            <Color>228B22</Color>
            <Size>L</Size>
        </ns2:Lower>
    </S:Body>
</S:Envelope>
